# -*- org-confirm-babel-evaluate: nil; org-babel-use-quick-and-dirty-noweb-expansion: t -*-
#+PROPERTY: header-args :results output :noweb yes

An abstract view of the open scope pattern.  Rather than dealing with full
JavaScript, the concept boils down to manipulating closures.  Let’s try that
with a lambda calculus interpreter.

Trying to reify the substitution of parameter names to their values that happen
during function application.  The substitution is done by the interpreter.  What
if we could push the substitution into the language, as an operator?

** Tests
#+BEGIN_SRC js
<<all>>
run(app(fun('x', v('x')), c(42)))
#+END_SRC

#+RESULTS:
: ((\x. x) 42)
:   (\x. x)
:   42
:   (x [x=42])
: => 42

The next one is my main interest.  It shows that a partially applied function
has /not/ reduced completely.  The substitution is suspended.

So, it should be possible to compose this closure with an operator that
substitutes the binding for ~x~.

#+BEGIN_SRC js
<<all>>
run(app(fun('x', fun('y', v('x'))), c(42)))
#+END_SRC

#+RESULTS:
: ((\x. (\y. x)) 42)
:   (\x. (\y. x))
:   42
:   ((\y. x) [x=42])
: => (\y. (x [x=42]))

I’ve tried using ~subst~ itself as the operator, since it /seems/ intuitively
the same thing.

Except there is an issue of order of evaluation of a ~subst~ containing a
~subst~.

So, why not use a separate operator at first?  Then later see if we can use
~subst~ for the same thing.

#+BEGIN_SRC js
<<all>>
run(app(R(app(fun('x', fun('y', v('x'))), c(42)), 'x', c(2)), c(0)))
#+END_SRC

#+RESULTS:
#+begin_example
((((\x. (\y. x)) 42) <x=2>) 0)
  (((\x. (\y. x)) 42) <x=2>)
((\x. (\y. x)) 42) 2
    ((\x. (\y. x)) 42)
      (\x. (\y. x))
      42
      ((\y. x) [x=42])
    2
    (\y. ((x [x=42]) <x=2>))
  0
  (((x [x=42]) <x=2>) [y=0])
=> Non-exhaustive subst: R
#+end_example


#+BEGIN_SRC js
// run(app(app(fun('x', fun('y', v('x'))), c(42)), c(0))) //: 42
// run(app(app(fun('x', fun('y', v('y'))), c(42)), c(0))) //: 0

//run(subst(c(0), 'x', c(1))) //: "Unknown node type undefined"
//run(subst(v('x'), 'x', c(1))) //: "Unknown node type undefined"
//run(subst(v('y'), 'x', c(1))) //: "Unknown node type undefined"
// run(subst(fun('x', c(0)), 'x', c(1))) //: "Unknown node type undefined"
// run(subst(fun('y', c(0)), 'x', c(1))) //: "Unknown node type undefined"
#+END_SRC

** Tests

#+BEGIN_SRC js
<<straight/all>>
run(app(fun('x', fun('y', v('x'))), c(42)))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC js
<<straight/all>>
run(app(app(fun('x', fun('y', v('x'))), c(42)), c(0)))
#+END_SRC

#+RESULTS:
: (((\x. (\y. x)) 42) 0)
:   ((\x. (\y. x)) 42)
:     (\x. (\y. x))
:     42
:     (\y. x)
:   0
:   x
: => 42

~R~ simply substitutes the environment of the closure to which it is applied.

#+BEGIN_SRC js
<<straight/all>>
run(R(app(fun('x', fun('y', v('x'))), c(42)), 'x', c(2)))
#+END_SRC

#+RESULTS:
: (((\x. (\y. x)) 42) <x=2>)
:   ((\x. (\y. x)) 42)
:     (\x. (\y. x))
:     42
:     (\y. x)
:   2
: => <\y x [x=2,x=42]>

We can then apply the closure, having changed its bindings.

#+BEGIN_SRC js
<<straight/all>>
run(app(R(app(fun('x', fun('y', v('x'))), c(42)), 'x', c(2)), c(0)))
#+END_SRC

#+RESULTS:
#+begin_example
((((\x. (\y. x)) 42) <x=2>) 0)
  (((\x. (\y. x)) 42) <x=2>)
    ((\x. (\y. x)) 42)
      (\x. (\y. x))
      42
      (\y. x)
    2
  0
  x
=> 2
#+end_example

So, module example.

#+BEGIN_SRC js
<<straight/all>>

var f = fun('x', plus(v('x'), v('a')))
var g = fun('x', app(v('f'), v('x')))

//run(app(fun('a', fun('f', fun('g', v('g')))), c(1)))
//run(app(app(fun('a', fun('f', fun('g', v('g')))), c(1)), f))
//run(app(app(app(fun('a', fun('f', fun('g', v('g')))), c(1)), f), g))
run(app(app(app(app(fun('a', fun('f', fun('g', v('g')))), c(1)), f), g), c(0)))
#+END_SRC

#+RESULTS:
#+begin_example
(((((\a. (\f. (\g. g))) 1) (\x. (x + a))) (\x. (f x))) 0)
  ((((\a. (\f. (\g. g))) 1) (\x. (x + a))) (\x. (f x)))
    (((\a. (\f. (\g. g))) 1) (\x. (x + a)))
      ((\a. (\f. (\g. g))) 1)
        (\a. (\f. (\g. g)))
a (\f. (\g. g)) []
        1
        (\f. (\g. g))
f (\g. g) [a=1]
      (\x. (x + a))
x (x + a) []
      (\g. g)
g g [f=<\x (x + a) []>,a=1]
    (\x. (f x))
x (f x) []
    g
  0
  (f x)
    f
    x
=> Not a closure Unknown variable f
#+end_example

* Equivalence with ~this~
In JS at least, the relation of open scope with ~this~ can be quickly
demonstrated.

#+BEGIN_SRC js
var m = (function(){
  var scope = Object.create(null)
  with (scope) {
    var a = 1
    function f(x) { return x + a }
    function g(x) { return f(x) }
  }
  return {g, scope}
}())

print(m.g(0))
m.scope.a = 2
print(m.g(0))
delete m.scope.a
print(m.g(0))
#+END_SRC

#+RESULTS:
: 1
: 2
: 1

Standard object idiom.  We can override the value of ~this~, and put our changes
in front /without altering the object itself/.

#+BEGIN_SRC js
var m = {
  a: 1,
  f(x) { return x + this.a },
  g(x) { return this.f(x) },
}

print(m.g(0))
print(m.g.call({__proto__: m, a:2}, 0))
print(m.g(0))
#+END_SRC

#+RESULTS:
: 1
: 2
: 1

We can dispense of ~this~ by creating our own binding environments.  Two layers
are needed to be able to override and delete bindings without affecting the
original definitions.

#+BEGIN_SRC js
var m = (function(){
  var env = Object.create(null)
  var scope = Object.create(env)
  env.a = 1
  env.f = function(x) { return x + scope.a }
  env.g = function(x) { return scope.f(x) }
  return {g: env.g, scope}
}())

print(m.g(0))
m.scope.a = 2
print(m.g(0))
delete m.scope.a
print(m.g(0))
#+END_SRC

#+RESULTS:
: 1
: 2
: 1

Which can also write using an object literal syntax:

#+BEGIN_SRC js
var m = (function(){
  var env = {
    a: 1,
    f(x) { return x + scope.a },
    g(x) { return scope.f(x) },
  }
  var scope = Object.create(env)
  return {g: env.g, scope}
}())

print(m.g(0))
m.scope.a = 2
print(m.g(0))
delete m.scope.a
print(m.g(0))
#+END_SRC

#+RESULTS:
: 1
: 2
: 1
